/*
*=====*=====*=====*=====*=====*=====*=====*=====*=====*=====*=====*=====*=====*
*                                                                             *
*                       RT-BOSS PORT [ Cortex-M3 Keil]                        *
*                                                                             *
*=====*=====*=====*=====*=====*=====*=====*=====*=====*=====*=====*=====*=====*
*/

/*===========================================================================*/
/*                               INCLUDE FILE                                */
/*---------------------------------------------------------------------------*/
#include "Boss_Kernel.h"

/*===========================================================================*/
/*                      DEFINITIONS & TYPEDEFS & MACROS                      */
/*---------------------------------------------------------------------------*/
#ifndef __ASM
#define __ASM            __asm
#endif

#define SCB_ICSR                    (*((volatile unsigned int *)(0xE000ED04)))
#define SCB_ICSR_PENDSVSET_BIT      (1ul << 28)


/*===========================================================================*/
/*                      [[ Cortex-M3 스택 초기 구성 ]]                       */
/*---------------------------------------------------------------------------*/
/*
[_Boss_stk_init()]                [ T C B  멤 버 ]
                  |------------|
                  | 하위  번지 |
                  |############|------------------------+
                  | 0xFFFFFFFF | <= p_tcb->sp_base[0]   |
                  |============|                        |
                  | 0x55555555 |                        |
                  | 0x55555555 |                        |
                  | 0x55555555 |                        |
                  | 0x55555555 |                        |
                  | 0x55555555 |                        |
                  | 0x55555555 |                        |
                  | 0x55555555 |                        |
                  | 0x55555555 |                        |
                  | 0x55555555 |                        |
                  | 0x55555555 |                        |
                  | 0x55555555 |                        |
                  | 0x55555555 |                        |
                  | 0x55555555 |                        |
                  | 0x55555555 |                        |
                  |============|                        |
    리턴 "SP" ->  | R4 (sp[0]) | <= p_tcb->sp           |
                  |------------|                        |
                  | R5 (sp[1]) |                        |
                  |------------|                        |
                  | R6 (sp[2]) |                        |
                  |------------|                        |
                  | R7 (sp[3]) |                  p_tcb->stk_size
                  |------------|                   (스택 크기)
                  | R8 (sp[4]) |                        |
                  |------------|                        |
                  | R9 (sp[5]) |                        |
                  |------------|                        |
                  | R10(sp[6]) |                        |
                  |------------|                        |
                  | R11(sp[7]) |                        |
                  |============|                        |
                  | R0 (sp[8]) |                        |
                  |------------|                        |
                  | R1 (sp[9]) |                        |
                  |------------|                        |
                  | R2(sp[10]) |                        |
                  |------------|                        |
                  | R3(sp[11]) |                        |
                  |------------|                        |
                  | R12(sp[12])|                        |
                  |------------|                        |
                  | LR(sp[13]) |                        |
                  |------------|                        |
                  | PC(sp[14]) |                        |
                  |------------|                        |
                  | PSR(sp[15])|                        |
                  |============|                        |
                  | 0xBBBBBBBB | <= &sp_base[size - 1]  |
                  |############|------------------------+
                  | 상위  번지 |
                  |------------|   "size = p_tcb->stk_size/ sizeof(boss_stk_t)"
*/

/*===========================================================================
    _ B O S S _ S T K _ I N I T
---------------------------------------------------------------------------*/
boss_stk_t *_Boss_stk_init(void (*executer)(void), boss_stk_t *sp_base, 
                                                        boss_uptr_t stk_bytes)
{
  boss_uptr_t size  = stk_bytes / sizeof(boss_uptr_t);
  boss_stk_t  *sp;
  
  boss_uptr_t i;
  for(i = 0; i <size; i++) {
    sp_base[i] = (boss_stk_t)0x55555555;      // 스택       [S] stack
  }
  
  sp_base[0]      = (boss_stk_t)0xFFFFFFFF;   // 스택 끝    [F] finis
  sp_base[size-1] = (boss_stk_t)0xBBBBBBBB;   // 스택 시작  [B] begin

  sp = &sp_base[size-1];

  /* 문맥 전환시 사용할 스택을 초기화 한다. */
  sp = sp - 16;   /* 저장할 레지스트 수 (16) */

  sp[0]   = 0x00000004L;          /* R4   */
  sp[1]   = 0x00000005L;          /* R5   */
  sp[2]   = 0x00000006L;          /* R6   */
  sp[3]   = 0x00000007L;          /* R7   */
  sp[4]   = 0x00000008L;          /* R8   */
  sp[5]   = 0x00000009L;          /* R9   */
  sp[6]   = 0x00000010L;          /* R10  */
  sp[7]   = 0x00000011L;          /* R11  */
  sp[8]   = 0x00000000L;          /* R0   */
  sp[9]   = 0x00000001L;          /* R1   */
  sp[10]  = 0x00000002L;          /* R2   */
  sp[11]  = 0x00000003L;          /* R3   */
  sp[12]  = 0x00000012L;          /* R12  */
  sp[13]  = 0x00000014L;          /* LR   */
  sp[14]  = (boss_stk_t)executer; /* PC   */
  sp[15]  = 0x01000000L;          /* PSR  */

  return sp;
}


/*===========================================================================
    _ B O S S _ C O N T E X T _ S W I T C H
---------------------------------------------------------------------------*/
void _Boss_context_switch(void)
{
  SCB_ICSR = SCB_ICSR_PENDSVSET_BIT;    /* PendSV_Handler 호출 */
}


/*===========================================================================
    P E N D S V _ H A N D L E R
---------------------------------------------------------------------------*/
__ASM void PendSV_Handler(void)
{
  IMPORT  _Boss_switch_current_tcb

  CPSID   I                   /* [ IRQ 비활성화 ] */

  MRS     R0, PSP         // R0-R3, R12, PC, PSR 저장되어 있음
  STMDB   R0!, {R4-R11}   // R4-R11 저장
  MOV     R4, LR          // LR 임시저장 (BL 사용을 위해)

  /*
  ** void *_Boss_switch_current_tcb(void *cur_task_sp)
  ** 매개변수 : "R0"는 실행중인 태스크 스택 포인터
  ** 리턴값   : "R0"는 실행할 태스크 스택 포인터
  */
  BL      _Boss_switch_current_tcb

  MOV     LR, R4          // LR 임시저장 (복원)
  LDMIA   R0!, {R4-R11}   // R4-R11 복원
  MSR     PSP, R0
  
  CPSIE   I                   /* [ IRQ 활성화 ]   */
  
  BX      LR              // 리턴 PendSV (R0-R3, R12, PC, PSR 복원)

  ALIGN
}


/*===========================================================================
    _   B O S S _ S T A R T _ S C H E D U L E
---------------------------------------------------------------------------*/
__ASM void _Boss_start_schedule(boss_stk_t *cur_task_sp)
{
  CPSIE   I     /* 인터럽트 활성화 (SVC 호출시 인트럽트 중지 상태이면 에러) */
  SVC     0     /* SVC 0 호출 (_SVC_Boss_start_schedule() 함수 실행)        */
}


/*===========================================================================
    _   S   V   C _   B O S S _ S T A R T _ S C H E D U L E
---------------------------------------------------------------------------*/
__ASM void _SVC_Boss_start_schedule(boss_stk_t *cur_task_sp)
{
  CPSID   I                   /* [ IRQ 비활성화 ] */
  LDMIA   R0!, {R4-R11}       /* R0 : cur_task_sp */
  MSR     PSP, R0

  LDR     R0, =0xE000ED08     /* NVIC Vector Table Offset Register  */
  LDR     R0, [R0]            /* Vector Table 시작 번지             */
  LDR     R0, [R0, #0]        /* 최기 스택 (__initial_sp)           */
  MSR     MSP, R0             /* "MSP"를 초기 스택 값으로 최기화    */

  LDR     LR, =0xFFFFFFFD     /* 스레드 특근 모드, PSP 사용           */
  CPSIE   I                   /* [ IRQ 활성화 ]   */
  BX      LR                  /* 리턴 SVC (R0-R3, R12, PC, PSR 복원) */

  ALIGN
}


/*===========================================================================
    _ M C U _ I S R _ R U N N I N G
---------------------------------------------------------------------------*/
__ASM boss_reg_t _mcu_isr_running(void)
{
  /* ISR (Interrupt Service Routine) 실행 상태 */
  MRS     R0, IPSR    /* 0 = ISR 아님  / !0 = ISR 실행중 */
  BX      LR
}


/*===========================================================================
    _ M C U _ I R Q _ H O L D
---------------------------------------------------------------------------*/
__ASM boss_reg_t _mcu_irq_hold(void)
{
  /* IRQ (Interrupt Request) 상태 */
  MRS     R0, PRIMASK   /* 0 = IRQ Enable  /  !0 = IRQ Disable  */
  BX      LR
}


/*===========================================================================
    _ M C U _ I R Q _ L O C K
---------------------------------------------------------------------------*/
__ASM boss_reg_t _mcu_irq_lock(void)
{
  MRS     R0, PRIMASK   /* IRQ 상태를 리턴 (_irq_store_)  */
  CPSID   I             /* IRQ 비활성화 한다.             */
  BX      LR
}


/*===========================================================================
    _ M C U _ I R Q _ F R E E
---------------------------------------------------------------------------*/
__ASM void _mcu_irq_free(boss_reg_t _irq_store_)
{
  MSR     PRIMASK, R0   /* IRQ 상태를 "_irq_store_"상태로 한다. */
  BX      LR
}

