/*
*=====*=====*=====*=====*=====*=====*=====*=====*=====*=====*=====*=====*=====*
*                                                                             *
*                       RT-BOSS PORT [ Cortex-M3 Keil]                        *
*                                                                             *
*=====*=====*=====*=====*=====*=====*=====*=====*=====*=====*=====*=====*=====*
*/

/*===========================================================================*/
/*                               INCLUDE FILE                                */
/*---------------------------------------------------------------------------*/
#include "../Boss/Boss_Kernel.h"

/*===========================================================================*/
/*                      DEFINITIONS & TYPEDEFS & MACROS                      */
/*---------------------------------------------------------------------------*/
#define SCB_ICSR                    (*((volatile unsigned int *)(0xE000ED04)))
#define SCB_ICSR_PENDSVSET_BIT      (1ul << 28)


/*===========================================================================*/
/*                      [[ Cortex-M3 스택 초기 구성 ]]                       */
/*---------------------------------------------------------------------------*/
/*
[_Boss_stk_init()]                [ T C B  멤 버 ]
                  |------------|
                  | 하위  번지 |
                  |############|------------------------+
                  | 0xFFFFFFFF | <= p_tcb->sp_base[0]   |
                  |============|                        |
                  | 0x55555555 |                        |
                  | 0x55555555 |                        |
                  | 0x55555555 |                        |
                  | 0x55555555 |                        |
                  | 0x55555555 |                        |
                  | 0x55555555 |                        |
                  | 0x55555555 |                        |
                  | 0x55555555 |                        |
                  | 0x55555555 |                        |
                  | 0x55555555 |                        |
                  | 0x55555555 |                        |
                  | 0x55555555 |                        |
                  | 0x55555555 |                        |
                  | 0x55555555 |                        |
                  |============|                        |
    리턴 "SP" ->  | R4 (sp[0]) | <= p_tcb->sp           |
                  |------------|                        |
                  | R5 (sp[1]) |                        |
                  |------------|                        |
                  | R6 (sp[2]) |                        |
                  |------------|                        |
                  | R7 (sp[3]) |                  p_tcb->stk_size
                  |------------|                   (스택 크기)
                  | R8 (sp[4]) |                        |
                  |------------|                        |
                  | R9 (sp[5]) |                        |
                  |------------|                        |
                  | R10(sp[6]) |                        |
                  |------------|                        |
                  | R11(sp[7]) |                        |
                  |============|                        |
                  | R0 (sp[8]) |                        |
                  |------------|                        |
                  | R1 (sp[9]) |                        |
                  |------------|                        |
                  | R2(sp[10]) |                        |
                  |------------|                        |
                  | R3(sp[11]) |                        |
                  |------------|                        |
                  | R12(sp[12])|                        |
                  |------------|                        |
                  | LR(sp[13]) |                        |
                  |------------|                        |
                  | PC(sp[14]) |                        |
                  |------------|                        |
                  | PSR(sp[15])|                        |
                  |============|                        |
                  | 0xBBBBBBBB | <= &sp_base[size - 1]  |
                  |############|------------------------+
                  | 상위  번지 |
                  |------------|   "size = p_tcb->stk_size/ sizeof(boss_stk_t)"
*/

/*===========================================================================
    _ B O S S _ S T K _ I N I T
---------------------------------------------------------------------------*/
boss_stk_t *_Boss_stk_init(void (*executer)(void), boss_stk_t *sp_base, 
                                                        boss_uptr_t stk_bytes)
{
  boss_uptr_t size  = stk_bytes / sizeof(boss_uptr_t);
  boss_stk_t  *sp;
  
  boss_uptr_t i;
  for(i = 0; i <size; i++) {
    sp_base[i] = (boss_stk_t)0x55555555;      // 스택       [S] stack
  }
  
  sp_base[0]      = (boss_stk_t)0xFFFFFFFF;   // 스택 끝    [F] finis
  sp_base[size-1] = (boss_stk_t)0xBBBBBBBB;   // 스택 시작  [B] begin

  sp = &sp_base[size-1];

  /* 문맥 전환시 사용할 스택을 초기화 한다. */
  sp = sp - 16;   /* 저장할 레지스트 수 (16) */

  sp[0]   = 0x00000004L;          /* R4   */
  sp[1]   = 0x00000005L;          /* R5   */
  sp[2]   = 0x00000006L;          /* R6   */
  sp[3]   = 0x00000007L;          /* R7   */
  sp[4]   = 0x00000008L;          /* R8   */
  sp[5]   = 0x00000009L;          /* R9   */
  sp[6]   = 0x00000010L;          /* R10  */
  sp[7]   = 0x00000011L;          /* R11  */
  sp[8]   = 0x00000000L;          /* R0   */
  sp[9]   = 0x00000001L;          /* R1   */
  sp[10]  = 0x00000002L;          /* R2   */
  sp[11]  = 0x00000003L;          /* R3   */
  sp[12]  = 0x00000012L;          /* R12  */
  sp[13]  = 0x00000014L;          /* LR   */
  sp[14]  = (boss_stk_t)executer; /* PC   */
  sp[15]  = 0x01000000L;          /* PSR  */

  return sp;
}


/*===========================================================================
    _ B O S S _ C O N T E X T _ S W I T C H
---------------------------------------------------------------------------*/
void _Boss_context_switch(void)
{
  SCB_ICSR = SCB_ICSR_PENDSVSET_BIT;    /* PendSV_Handler 호출 */
}

/*
** 아래의 함수는 "MCU_Cortex_M3_IAR_asm.s" 참조
**
** void PendSV_Handler(void);
** void _Boss_start_schedule(boss_stk_t *cur_task_sp);
** void _SVC_Boss_start_schedule(boss_stk_t *cur_task_sp);
** boss_reg_t _mcu_irq_storage(void);
** void _mcu_irq_restore(boss_reg_t _irq_store_);
** boss_reg_t _mcu_irq_hold(void);
** boss_reg_t _mcu_isr_running(void);
*/
